app/controllers/merge_controller.rb

INSERT INTO "api_keys" ("key", "created_at", "updated_at") VALUES (?, ?, ?)  [["key", "58eb630c3eff01777a5615f1bc2a3317"], ["created_at", "2015-05-31 21:12:05.276454"], ["updated_at", "2015-05-31 21:12:05.276454"]]
---
  def generate
    key = SecureRandom.hex
    ApiKey.create!(key: key)